package com.yazanmy.HajjAndUmrah_Guide;

import android.os.Bundle;
import android.text.Html;
import android.widget.TextView;

import androidx.appcompat.app.AppCompatActivity;

public class Hajj extends AppCompatActivity {


    String htmlString =
            "<h1>صفة الحج</h1>\n" +

                    "<p>وردت عن النبي محمد العديد من الأحاديث النبوية التي تتحدث عن فضل أداء مناسك الحج وعن الثواب الذي يجنيه المسلم جراء أداء هذا الركن من أركان الإسلام، ومن أبرز هذه الأحاديث: ما ورد في سنن الترمذي عن عبد الله بن مسعود أنه قال: أن رسول الله قال: تابعوا بين الحج والعمرة ، فإنهما ينفيان الفقر والذنوب كما ينفي الكير خبث الحديد والذهب والفضة ، وليس للحجة المبرورة ثواب إلا الجنة، وما ورد في صحيح البخاري عن أبي هريرة أنه قال: “أن رسول الله سئل أي العمل أفضل؟ فقال: إيمان بالله ورسوله. قيل: ثم ماذا؟ قال: الجهاد في سبيل الله. قيل: ثم ماذا؟ قال: حج مبرور”. وما ورد في صحيح البخاري عن أبي هريرة أنه قال: سمعت رسول الله يقول: “من حج، فلم يرفث ولم يفسق، رجع من ذنوبه كيوم ولدته أمه”. وما ورد في صحيح البخاري عن أبي هريرة أنه قال: أن رسول الله قال: “العمرة إلى العمرة كفارة لما بينهما ، والحج المبرور ليس له جزاء إلا الجنة”، وما ورد في سنن النسائي عن أبي هريرة أنه قال: أن رسول الله قال: “جهاد الكبير والضعيف والمرأة: الحج والعمرة”. وما ورد في صحيح البخاري عن عائشة أنها قالت: قلت لرسول الله “يا رسول الله، نرى الجهاد أفضل العمل أفلا نجاهد؟ قال: لكن أفضل من الجهاد حج مبرور”.وما ورد في صحيح مسلم عن عائشة أنها قالت: أن رسول الله قال: “ما من يوم أكثر من أن يعتق الله فيه عبداً من النار من يوم عرفة”.</p>" +


                    "<h3> حكم الحج\n</h3>\n" +

                    "<p>الحج واجب، وهو ركن من أركان الإسلام، ودليل وجوب الحج الكتاب والسُّنَّة والإجماع. فأما الكتاب: فقوله تعالى: ﴿ وَلِلَّهِ عَلَى النَّاسِ حِجُّ الْبَيْتِ مَنِ اسْتَطَاعَ إِلَيْهِ سَبِيلًا ﴾ [آل عمران: 97].</p>" +

                    "<p>أما السُّنَّة: فَعَنِ ابْنِ عُمَرَ رضي الله عنهما، قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: “بُنِيَ الإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامِ الصَّلَاةِ، وَإِيتَاءِ الزَّكَاةِ، وَالحَجِّ، وَصَوْمِ رَمَضَانَ”.</p>" +

                    "<p>وَعَنْ أَبِي هُرَيْرَةَ رضي الله عنه، قَالَ: خَطَبَنَا رَسُولُ اللهِ صلى الله عليه وسلم، فَقَالَ: “أَيُّهَا النَّاسُ قَدْ فَرَضَ اللهُ عَلَيْكُمُ الْحَجَّ، فَحُجُّوا”. وأما الإجماع: فقد قال ابن قدامة رضي الله عنه: “وَأَجْمَعَتِ الْأُمَّةُ عَلَى وُجُوبِ الْحَجِّ عَلَى الْمُسْتَطِيعِ فِي الْعُمُرِ مَرَّةً وَاحِدَةً”.</p>" +


                    "<h3 >خطوات الحج بالترتيب</h3>" +

                    "<p>في سورة البقرة آية 197 يقول الله تعالى: “الْحَجُّ أَشْهُرٌ مَّعْلُومَاتٌ ۚ فَمَن فَرَضَ فِيهِنَّ الْحَجَّ فَلَا رَفَثَ وَلَا فُسُوقَ وَلَا جِدَالَ فِي الْحَجِّ ۗ وَمَا تَفْعَلُوا مِنْ خَيْرٍ يَعْلَمْهُ اللَّهُ ۗ وَتَزَوَّدُوا فَإِنَّ خَيْرَ الزَّادِ التَّقْوَىٰ ۚ وَاتَّقُونِ يَا أُولِي الْأَلْبَابِ”، فالحج أحد الفرائض الخمس التي على المسلم القادر أن يقوم بها، وفيه متعة خاصة بالتقرب إلى الله سبحانه وتعالى، وفي النقاط التالية سنتناول بالترتيب خطوات أداء مناسك الحج، وهى:</p>" +

                    "<ul><li>يبدأ الحجُّ بالإحرام، فعند وصول الحجّاج إلى مكة وبلوغهم البيت الحرام يطوفوا حول الكعبة المشرفة 7 أشواط، بدءاً بالحجر الأسود، وبعد الإنتهاء من الطواف يقوم الحاج بصلاة ركعتين عند مقام إبراهيم إذا تمكن من ذلك.</li><li>يقوم الحاج بالسعي بين الصفا والمروة 7 أشواط، وبعد الطواف والسعي يقوم الحالج بالحلق ليتحلل من إحرامه ويعود ليجدهه يوم 8 من ذي الحجة.</li><li>في يوم 8 ذي الحجة، يبات الحاج في مِنى بما يسمى يوم التروية، ويصلي هناك الظهر والعصر والمغرب والعشاء وفجر اليوم التاسع من ذي الحجة “يوم عرفة”.</li><li>بعد طلوع الفجر في يوم عرفة “9 ذي الحجة”، يسير الحاج من مِنى إلى جبل عرفة، ويقف هناك ليؤدي صلاتي الظهر والعصر قصراً وجمع تقديم، ثم يستمرون في الذكر والدعاء حتى غروب الشمس.</li><li>وقت غروب الشمس في يوم عرفة يزلف الحاج أي ينتقل إلى مزدلفة، ويصلوا هناك المغرب والعشاء جمع تأخير، ثم يبيتون هذه الليلة هناك.</li><li>في يوم 10 ذي الحجة يسير الحجّاج من مزدلفة إلى مِنى، ويكون هذا السير قبل طلوع المش ويسمى هذا يوم النحر، فيقوموا خلاله بعدة شعائر تتمثل في:</li><li>رمي جمرة العقبة “الجمرة الكبرى”، فيقوم الحاج فيها بسبع حصيات ويكبر عند رمي كل واحدة، وأثناء الرمي يتوقف الحاج عن التلبية، ثم يقوم بالذبح إذا كان الحاج متمتعاً أو قارناً وغيرهم فيكون الذبح سنّة.</li><li>يحلق الحجاج رؤوسهم أو يقصرون شعرهم، ويفضل الحلق للرجال، ليتحللوا من إحرامهم، ويصبح كل شيء محلل لهم فيما عدا الجماع مع الزوجات.</li><li>ينزل الحاج إلى مكة ليطوفوا طواف الإفاضة وتسمى طواف الزيارة، ويقوم بالسعي بين الصفا والمروة من لم يستطع السعي فور وصوله لمكة، ثم يقوم بالتحلل الثاني من الإحرام، حيث يحل لهم كل ما كان محظوراً حتى الجماع مع زوجاتهن.</li><li>في أول وثاني أيام التَّشريق أي ثاني وثالث أيام النحر يعود الحاج إلى منِى ويبيت فيها هاتين الليلتين، والمبيت في مِنى هذان اليومان فرض واج عند الجمهور وسنّة عند الحنفية، وخلال هذين اليومين يقومون بإلقاء الجمرات الثَلاث: الصغرى وهي أقرب الجمرات إلى مسجد الخْيف الموجود بمِنى، الجمرة الوسطى ثم الجمرة الثالثة وهي جمرة العقبة أو الجمرة الكبرى، ويتم إلقاء كلِ واحدة منهم بسبع حصيات، والدعاء بين كل جمرتين، وفي حالة الإنتهاء من الرمي في اليوم الثاني من أيام التشريق بإمكان الحاج الإختيار بين التعجل والعودة لمكة أو المكوث والمبيت في مِنى لليلة ثالثة من أيام التشريق.</li><li>في ثالث أيام التشريق يقوم الحاج غير المتعجل برمي الجمرات الثلاث كما فعل في اليومين السابقين، ثم يتجه إلى مكّة بعد ذلك.</li><li>وأخيراً ينتهي الحاج بطواف الوداع بعد عودته إلى مكّة، فيطوف بالكعبة 7 أشواط بما يسمى طواف الوداع، أي إنتهاء أداء مناسك الحج وتوديع بيت الله الحرام، وهو طواف واجب عند جمهور الفقهاء، والحكمة منه أن يختتم به الحاج مناسكه كاملة.</li></ul>" +

                    "<h3>شروط الحج الصحيحة</h3>" +

                    "<ul><li>الإسلام.</li><li> العقل.</li><li> البلوغ.</li><li>الاستطاعة، وهي وجود الزاد والراحلة الصالحين لمثله.</li><li>كمال الحرية.</li><li> وتزيد المرأة شرطاً سادساً وهو المَحْرَمُ؛ فإن حجَّت بدون محرم أثِمت وحجها صحيح.</li></ul>" +

                    "<p>وينبغي التنبه إلى مسائل متعلقة بالحج وشروطه ومن ذلك:</p>" +

                    "<ul><li> إذا أحرم الصبي بالحج صحَّ منه نفلاً وتلزمه حجة الإسلام إذا بلغ.</li><li>إذا مات من لزمه الحج ولم يحج أخرج من تركته مال يُحجّ به عنه.</li><li>لا يحج عن غيره من لم يحج عن نفسه، ويصح أن يستنيب قادر وغيره في نفل حج أو عمرة.</li></ul>";





    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_hajj);


        TextView textView = (TextView) findViewById(R.id.textView5);
        textView.setText(Html.fromHtml(htmlString));
    }
}
