package com.yazanmy.HajjAndUmrah_Guide;

import android.os.Bundle;
import android.text.Html;
import android.widget.TextView;

import androidx.appcompat.app.AppCompatActivity;

public class Umrah extends AppCompatActivity {


    String htmlString =
            "<h1>صفة العمرة</h1>\n" +
                    "<h3>1- تبدأ من الميقات:</h3>\n" +
                    "<p>• تًجرّد من الثياب، واغتسل كما تغتسل من الجنابة – إن تيسر لك – وتطيب بأطيب ما تجده من دهن عود أو غيره في رأسك ولحيتك، ولا يضر بقاء ذلك بعد الإحرام، ولكن لا تطيب ثياب الإحرام.  </p>" +

                    "<p>• البس ثياب الإحرام (إزاراً ورداءً) ولف الرداء على كتفيك ولا تخرج الكتف الأيمن إلا في الطواف بجميع أنواعه (هذا للرجل). (أما المرأة) فتحرم في ملابسها العادية التي ليس فيها زينة ولا شهرة ولا تلزم بلون معين. </p>" +

                    "<p> • صل الصلاة المكتوبة إذا حان وقتها، وصل ركعتين سنة الإحرام (وإن لم تصلها فلا حرج).</p>" +

                    "\n" +
                    "<p>بعدها: إذا ركبت السيارة انْو ِ الدخول في النسكثم – قل – حسب نسكك: </p>" +

                    "<ol>\n" +
                    "\t<li>1- إن كنت تريد العمرة فقط : (لبيك عمرة).</li> \n" +
                    "\t<li>2- وإن كنت تريد الحج فقط – الإفراد - :( لبيك حجاً)</li>\n" +
                    "\t<li>3- وإن كنت تريد الحج والعمرة بأفعالهما – التمتع - : (لبيك عمرة متمتعاً بها إلى الحج).</li>\n" +
                    "\t<li>4- وإن كنت تريد الحج والعمرة بأفعال الحج – القارن -: (لبيك عمرة وحجاً). </li>\n" +
                    "</ol>" +
                    "<p>ولا يلزم تكرار هذه الألفاظ ثلاثاً، بل مرة واحدة تكفي. </p>" +

                    "<p> </p>" +

                    "\n" +


                    "<h3>ملاحظات: </h3>\n" +
                    "<ol>" +
                    "\t<li>1. كل نسك من هذه الأنساك له فائدته الخاصة.</li> " +
                    "\t<li>2. بينها فروق في النية والألفاظ والأفعال.</li>" +
                    "\t<li>3. أفضلها: التمتع، ثم الإفراد، ثم القران.</li>" +
                    "\t<li>4. القران تحتاج إليه المرأة إذا أرادت الإحرام متمتعة ولم تستطع أن تنجز عمرتها حتى حاضت. وكذلك من قدم متأخراً حتى خشي فوات الوقوف بعرفة وكذلك من صُدَ عن البيت لأي سبب</li>" +
                    "</ol>" +


                    "<p> ثم إن خشيت عدم القدرة على المضي في النسك، بسبب مرض أو عمل أو إجراءات نظامية فلتقل:" +
                    "\"اللهم محلي حيث حبستني\" " + "</p> " +


                    "<p> وأما إن لم تخش شيئاً فلا يشرع لك هذا الاشتراط.   وفائدته : لو حبست عن النسك جاز لك شرعاً أن تخلع إحرامك وترجع ولا يلزمك شيء.</p>" +

                    "<p>ثم تبدأ بالتلبية:  </p>" +


                    "<p><b> وأما الدعاء: \"اللهم أني أريد العمرة، فيسرها لي وتقبلها مني، لبيك اللهم لبيك، لبيك لا شريك لك لبيك، إن الحمد والنعمة لك والملك، لا شريك لك\"، فلا يلزم دعاء بعينه، بل يدعو بما أراد.\n" +
                    "وكذلك الصلاة على النبي صلى الله عليه وسلم لم ترد في هذا الموضع. وكذلك \"اللهم إني أسألك رضاك والجنة وأعوذ بك من سخطك والنار\".</b> </p>" +


                    "<p>يشرع في الطريق: أن تكبر الله كلما صعدت مرتفعاً، وأن تسبح كلما هبطت وادياً.\n" +
                    "\n" +
                    "ثم ترجع للتلبية العامة: \"لبيك اللهم لبيك...الخ\". حتى تصل إلى البيت الحرام. </p>" +

                    "<h3>2- توجه إلى المسجد الحرام للطواف:</h3>\n" +


                    "<p>عند رؤيتك للبيت كبر وقل: \"اللهم زد هذا البيت تشريفاً وتعظيماً وتكريماً ومهابة وأمناً، وزد من شرفه وكرمه ممن حجه أو اعتمره تشريفاً وتكريماً وتعظيماً وبِراً\". </p>" +


                    "<p>• اقطع التلبية وتوجه إلى البيت الحرام. </p>" +
                    "<p> • إذا دخلت المسجد الحرام، قدم رجلك اليمنى وقل:</p>" +
                    "<p><b> \"بسم الله والصلاة والسلام على رسول الله، اللهم اغفر لي ذنوبي وافتح لي أبواب رحمتك\".\n" +
                    "أو : \"أعوذ بوجهك العظيم وسلطانك القديم من الشيطان الرجيم\"." +
                    " </b> </p>" +

                    "<p> تقدم إلى الحجر الأسود لتبدأ الطواف منه، استلم الحجر بيدك اليمنى وقبله، فإن شق التقبيل فاستلمه بيدك فقط، وإن شق بيدك فاستلمه بعصا أو غيرها ولا تقبلها، فإن شق الاستلام، فأشر إليه بيدك اليمنى ولا تقبلها•.</p>" +
                    "<p>• من الأفضل ألا تؤذي المعتمرين في حال الزحام، جاعلاً البيت على يسارك مضطبعاً بردائك (اجعل كتفك الأيمن مكشوفاً). وكلما وصلت الحجر الأسود أو حاذيته قل: \"بسم الله، الله أكبر. أو \"الله أكبر\" فقط. </p>" +
                    "<p>• ارمل (أسرع قليلاً) في الأشواط الثلاثة الأولى، وامش على مهل في الأشواط الأربعة الباقية، وهذا خاص بطواف القدوم فقط إن تيسر وإلا فإنه يترك مع شدة الزحام. </p>" +
                    "<p>• عندما تكمل الأشواط السبعة، توجه إلى مقام إبراهيم واقرأ قوله تعالى: \"واتخذوا من مقام إبراهيم مصلى\" وصل ركعتين خلف المقام قريباً منه إن تيسر لك – أو بعيداً في أي مكان من المسجد. تقرأ بعد الفاتحة \"قل يا أيها الكافرون\" في الركعة الأولى، وتقرأ بعد الفاتحة \"قل هو الله أحد\" في الركعة الثانية، وان قرأت بغيرهما فلا بأس.</p>" +

                    "<p>• اذهب إلى زمزم واشرب منها واحمد الله. </p>" +


                    "<h3>3- اخرج إلى الصفا للسعي:</h3>\n" +

                    "<p> • اصعد عليه (وهو الأفضل) حتى ترى الكعبة واستقبلها وارفع يديك وهلل وكبر ثلاثاً، وقل: \"لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير. لا إله إلا الله وحده أنجز وعده ونصر عبده وهزم الأحزاب وحده\" ثلاث مرات.\n" +
                    "\n" +
                    "ثم اقرأ \" إن الصفا والمروة من شعائر الله فمن حج البيت أو اعتمر فلا جناح عليه أن يطوف بهما ومن تطوع خيراً فإن الله شاكر عليم\".\n" +
                    "\n" +
                    "وهذه تقرأ عند أول شوط فقط، ويفضل أن تبدأ بها قبل الأذكار الأخرى. ثم تدعو بما تحب من الدعاء في هذا الموضع وترفع يديك.\n" +
                    "\n" +
                    "ثم انزل باتجاه المروة، وهرول بين العلمين الأخضرين قائلاً: \"رب اغفر وارحم وتجاوز عما تعلم إنك أنت الأعز الأكرم\".\n" +
                    "\n" +
                    "وتمشي المشي المعتاد في سعيك قبلهما وبعدهما. (أما المرأة فلا يشرع لها الإسراع). وتدعو أثناء السعي بما تحب وليس لكل شوط دعاء مخصوص." +
                    " </p>" +

                    "<p>• إذا وصلت المروة فافعل كما فعلت على الصفا ما عدا قراءة الآية المذكورة فإنها تقرأ عند الصفا في الشوط الأول فقط.\n" +
                    "كرر السعي سبعة أشواط.\n" +
                    "(يحسب الذهاب شوطاً والرجوع شوطاً آخر)</p>" +


                    "<h3>4- الحلق أو التقصير:</h3>\n" +


                    "<p>• إذا أكملت السعي، احلق شعرك أو قصره والحلق أفضل في الحج). (أما المرأة فتقصر من كل ظفيرة قدر أنملة). </p>" +
                    "<p>• اخلع إحرامك والبس ثيابك.وبذلك تكون قد أديت عمرة كاملة </p>" +

                    "<p> </p>";


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_umrah);

        TextView textView = (TextView) findViewById(R.id.textView5);
        textView.setText(Html.fromHtml(htmlString));

    }
}
